---
title: SlabShapeCrease
classe: Autodesk.Revit.DB.SlabShapeCrease
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# SlabShapeCrease

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `SlabShapeCreaseType CreaseType { get; }` | `slabShapeCrease.CreaseType` | SlabShapeCreaseType |
| `Curve Curve { get; }` | `slabShapeCrease.Curve` | Curve |
| `SlabShapeVertexArray EndPoints { get; }` | `slabShapeCrease.EndPoints` | SlabShapeVertexArray |
| `Boolean IsValidObject { get; }` | `slabShapeCrease.IsValidObject` | Boolean |
| `Void Dispose()` | `slabShapeCrease.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```